{
  "title": "Gemini Image Kit 覚醒編",
  "pages": [
    {
      "page": 1,
      "visual_anchor": "90s retro mecha anime style, strictly following the character design and outfit from the provided reference image, Metan standing in front of a giant tactical hologram, dramatic shadows, intense lighting, no speech bubbles, no text, clear illustration.",
      "dialogue": "[めたん] あえて言おう！ Gemini Image Kitこそが勝利の鍵だと！",
      "speaker_id": "metan",
      "reference_url": ""
    },
    {
      "page": 2,
      "visual_anchor": "90s retro mecha anime style, strictly following the character design and outfit from the provided reference image, Zundamon in a cockpit, sweating, red warning lights, extreme close-up on eyes (cut-in), no speech bubbles, no text, clear illustration.",
      "dialogue": "[ずんだもん] 画像生成の『面倒』に、ボクの魂が引かれそうなのだ！",
      "speaker_id": "zundamon",
      "reference_url": ""
    },
    {
      "page": 3,
      "visual_anchor": "90s retro mecha anime style, strictly following the character design and outfit from the provided reference image, Metan pointing at a screen showing multiple image data streams, dramatic low angle, no speech bubbles, no text, clear illustration.",
      "dialogue": "[めたん] マルチモーダル！ 複数の参照画像を戦術に組み込むのよ！",
      "speaker_id": "metan",
      "reference_url": ""
    },
    {
      "page": 4,
      "visual_anchor": "90s retro mecha anime style, strictly following the character design and outfit from the provided reference image, Zundamon shocked, speed lines, background of glowing server racks, no speech bubbles, no text, clear illustration.",
      "dialogue": "[ずんだもん] キャッシュ機能！？ 読み込みが通常の3倍なのだよ！",
      "speaker_id": "zundamon",
      "reference_url": ""
    },
    {
      "page": 5,
      "visual_anchor": "90s retro mecha anime style, strictly following the character design and outfit from the provided reference image, Metan with arms crossed, server room looking like a spaceship engine room, dramatic shadows, no speech bubbles, no text, clear illustration.",
      "dialogue": "[めたん] ドメイン駆動設計…… 内部仕様に依存せぬクリーンな魂よ。",
      "speaker_id": "metan",
      "reference_url": ""
    },
    {
      "page": 6,
      "visual_anchor": "90s retro mecha anime style, strictly following the character design and outfit from the provided reference image, Metan activating a glowing energy shield, tactical displays, no speech bubbles, no text, clear illustration.",
      "dialogue": "[めたん] SSRFを排除せよ！ IP制限こそが鉄壁の盾となる！",
      "speaker_id": "metan",
      "reference_url": ""
    },
    {
      "page": 7,
      "visual_anchor": "90s retro mecha anime style, strictly following the character design and outfit from the provided reference image, Zundamon typing on a glowing holographic keyboard, impact frames, no speech bubbles, no text, clear illustration.",
      "dialogue": "[ずんだもん] 数行のコードで、ボクの画像が加速していくのだ！",
      "speaker_id": "zundamon",
      "reference_url": ""
    },
    {
      "page": 8,
      "visual_anchor": "90s retro mecha anime style, strictly following the character design and outfit from the provided reference image, Metan and Zundamon looking at a brilliant light from a monitor, celestial background, no speech bubbles, no text, clear illustration.",
      "dialogue": "[めたん] 生成完了。これが新たな宇宙（画像）の始まりよ。",
      "speaker_id": "metan",
      "reference_url": ""
    }
  ]
}
